# Data Cleaning Assignment

It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:<br>
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],'FlightNumber':[10045,np.nan,10065,np.nan,10085],'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],'Airline':['KLM(!)','<Air France> (12)','(British Airways .)','12. Air France','''Swiss Air''']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways .)
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]            Swiss Air

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [4]:
# The numbers in FlightNumber column are meant to increase by 10 with each row.
k = df['FlightNumber']
for i in range(len(k)):
    if k.iloc[i]>0:
        continue
    else:
        k[i] = k[i-1] + 10
        
df['FlightNumber'] = k

C:\Users\Mahas\anaconda3\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [5]:
# Filling the missing numbers in column FlightNumber
df['FlightNumber']

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [6]:
# changing the FlightNumber column type from float64 to int64 
df['FlightNumber'] = df['FlightNumber'].astype('int64')
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [7]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways .)
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]            Swiss Air

In [8]:
# splitting the From_to columnon the underscore delimiter as two seperate columns.
temp = df['From_To'].str.split('_', n=1, expand = True)
# Assigning the correct column names to the temporary dataframe.
temp.columns = ['From','To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [9]:
# Capitalizing the city names
temp['From'] = temp.From.str.capitalize()
temp['To'] = temp.To.str.capitalize()
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [10]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways .)
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]            Swiss Air

In [11]:
# Deleting the From_to column from df.
df.drop('From_To',axis = 1, inplace = True)
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways .)
3         10075          [13]       12. Air France
4         10085      [67, 32]            Swiss Air

In [12]:
# Attaching the temporary dataframe to the df
df = temp.join(df)
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways .)
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]            Swiss Air

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.\
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [13]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways .)
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]            Swiss Air

In [14]:
# In RecentDelays column, the list values are made into their respective columns and NaN is substituted for absence of a value.
c = df.RecentDelays
m = max(df.RecentDelays.apply(len))
for i in c:
    if len(i)<m:
        diff = m-len(i)
        for j in range(diff):
            i.append('NaN')
          
            
c

0      [23, 47, NaN]
1    [NaN, NaN, NaN]
2       [24, 43, 87]
3     [13, NaN, NaN]
4      [67, 32, NaN]
Name: RecentDelays, dtype: object

In [15]:
# Expand the series of list into a dataframe named delays and rename each column with delay_1, delay_2 and delay_3
cat1 = [x[0] for x in c]
cat2 = [x[1] for x in c]
cat3 = [x[2] for x in c]
delays = pd.DataFrame({'delay_1':cat1,'delay_2':cat2,'delay_3':cat3})
delays

  delay_1 delay_2 delay_3
0      23      47     NaN
1     NaN     NaN     NaN
2      24      43      87
3      13     NaN     NaN
4      67      32     NaN

In [16]:
# Deleting the unwanted RecentDelays column 
df.drop('RecentDelays', axis=1, inplace=True)
df

       From         To  FlightNumber              Airline
0    London      Paris         10045               KLM(!)
1    Madrid      Milan         10055    <Air France> (12)
2    London  Stockholm         10065  (British Airways .)
3  Budapest      Paris         10075       12. Air France
4  Brussels     London         10085            Swiss Air

In [17]:
# Replacing the deleted RecentDelays column in df with delays.
df.insert(3,'delay_1',cat1)
df.insert(4,'delay_2',cat2)
df.insert(5,'delay_3',cat3)
df

,From,To,FlightNumber,delay_1,delay_2,delay_3,Airline
0,London,Paris,10045,23,47,NaN,KLM(!)
1,Madrid,Milan,10055,NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065,24,43,87,(British Airways .)
3,Budapest,Paris,10075,13,NaN,NaN,12. Air France
4,Brussels,London,10085,67,32,NaN,Swiss Air